espressif/esp-idf/components/soc/esp32p4/include/soc/axi_dma_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: in */
/** Type of in_int_raw_chn register
 *  Raw status interrupt of channel 0
 */
typedef union {
    struct {
        /** in_done_chn_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been received for Rx channel 0.
         */
        uint32_t in_done_chn_int_raw:1;
        /** in_suc_eof_chn_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been received for Rx channel 0. For UHCI0 the raw interrupt bit
         *  turns to high level when the last data pointed by one inlink descriptor has been
         *  received and no data error is detected for Rx channel 0.
         */
        uint32_t in_suc_eof_chn_int_raw:1;
        /** in_err_eof_chn_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit turns to high level when data error is detected only in the
         *  case that the peripheral is UHCI0 for Rx channel 0. For other peripherals this raw
         *  interrupt is reserved.
         */
        uint32_t in_err_eof_chn_int_raw:1;
        /** in_dscr_err_chn_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit turns to high level when detecting inlink descriptor error
         *  including owner error and the second and third word error of inlink descriptor for
         *  Rx channel 0.
         */
        uint32_t in_dscr_err_chn_int_raw:1;
        /** in_dscr_empty_chn_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit turns to high level when Rx buffer pointed by inlink is full
         *  and receiving data is not completed but there is no more inlink for Rx channel 0.
         */
        uint32_t in_dscr_empty_chn_int_raw:1;
        /** infifo_l1_ovf_chn_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
         *  overflow.
         */
        uint32_t infifo_l1_ovf_chn_int_raw:1;
        /** infifo_l1_udf_chn_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
         *  underflow.
         */
        uint32_t infifo_l1_udf_chn_int_raw:1;
        /** infifo_l2_ovf_chn_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
         *  overflow.
         */
        uint32_t infifo_l2_ovf_chn_int_raw:1;
        /** infifo_l2_udf_chn_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
         *  underflow.
         */
        uint32_t infifo_l2_udf_chn_int_raw:1;
        /** infifo_l3_ovf_chn_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
         *  overflow.
         */
        uint32_t infifo_l3_ovf_chn_int_raw:1;
        /** infifo_l3_udf_chn_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
         *  underflow.
         */
        uint32_t infifo_l3_udf_chn_int_raw:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} axi_dma_in_int_raw_chn_reg_t;

/** Type of in_int_st_chn register
 *  Masked interrupt of channel 0
 */
typedef union {
    struct {
        /** in_done_chn_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_chn_int_st:1;
        /** in_suc_eof_chn_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_chn_int_st:1;
        /** in_err_eof_chn_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_chn_int_st:1;
        /** in_dscr_err_chn_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_chn_int_st:1;
        /** in_dscr_empty_chn_int_st : RO; bitpos: [4]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_chn_int_st:1;
        /** infifo_l1_ovf_chn_int_st : RO; bitpos: [5]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_l1_ovf_chn_int_st:1;
        /** infifo_l1_udf_chn_int_st : RO; bitpos: [6]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_l1_udf_chn_int_st:1;
        /** infifo_l2_ovf_chn_int_st : RO; bitpos: [7]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_l2_ovf_chn_int_st:1;
        /** infifo_l2_udf_chn_int_st : RO; bitpos: [8]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_l2_udf_chn_int_st:1;
        /** infifo_l3_ovf_chn_int_st : RO; bitpos: [9]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t infifo_l3_ovf_chn_int_st:1;
        /** infifo_l3_udf_chn_int_st : RO; bitpos: [10]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t infifo_l3_udf_chn_int_st:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} axi_dma_in_int_st_chn_reg_t;

/** Type of in_int_ena_chn register
 *  Interrupt enable bits of channel 0
 */
typedef union {
    struct {
        /** in_done_chn_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_chn_int_ena:1;
        /** in_suc_eof_chn_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_chn_int_ena:1;
        /** in_err_eof_chn_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_chn_int_ena:1;
        /** in_dscr_err_chn_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_chn_int_ena:1;
        /** in_dscr_empty_chn_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_chn_int_ena:1;
        /** infifo_l1_ovf_chn_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_l1_ovf_chn_int_ena:1;
        /** infifo_l1_udf_chn_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_l1_udf_chn_int_ena:1;
        /** infifo_l2_ovf_chn_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_l2_ovf_chn_int_ena:1;
        /** infifo_l2_udf_chn_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_l2_udf_chn_int_ena:1;
        /** infifo_l3_ovf_chn_int_ena : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t infifo_l3_ovf_chn_int_ena:1;
        /** infifo_l3_udf_chn_int_ena : R/W; bitpos: [10]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t infifo_l3_udf_chn_int_ena:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} axi_dma_in_int_ena_chn_reg_t;

/** Type of in_int_clr_chn register
 *  Interrupt clear bits of channel 0
 */
typedef union {
    struct {
        /** in_done_chn_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_chn_int_clr:1;
        /** in_suc_eof_chn_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_chn_int_clr:1;
        /** in_err_eof_chn_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_chn_int_clr:1;
        /** in_dscr_err_chn_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_chn_int_clr:1;
        /** in_dscr_empty_chn_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_chn_int_clr:1;
        /** infifo_l1_ovf_chn_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_l1_ovf_chn_int_clr:1;
        /** infifo_l1_udf_chn_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_l1_udf_chn_int_clr:1;
        /** infifo_l2_ovf_chn_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_l2_ovf_chn_int_clr:1;
        /** infifo_l2_udf_chn_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_l2_udf_chn_int_clr:1;
        /** infifo_l3_ovf_chn_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t infifo_l3_ovf_chn_int_clr:1;
        /** infifo_l3_udf_chn_int_clr : WT; bitpos: [10]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t infifo_l3_udf_chn_int_clr:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} axi_dma_in_int_clr_chn_reg_t;

/** Type of in_conf0_chn register
 *  Configure 0 register of Rx channel 0
 */
typedef union {
    struct {
        /** in_rst_chn : R/W; bitpos: [0]; default: 0;
         *  This bit is used to reset AXI_DMA channel 0 Rx FSM and Rx FIFO pointer.
         */
        uint32_t in_rst_chn:1;
        /** in_loop_test_chn : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t in_loop_test_chn:1;
        /** mem_trans_en_chn : R/W; bitpos: [2]; default: 0;
         *  Set this bit 1 to enable automatic transmitting data from memory to memory via
         *  AXI_DMA.
         */
        uint32_t mem_trans_en_chn:1;
        /** in_etm_en_chn : R/W; bitpos: [3]; default: 0;
         *  Set this bit to 1 to enable etm control mode, dma Rx channel 0 is triggered by etm
         *  task.
         */
        uint32_t in_etm_en_chn:1;
        /** in_burst_size_sel_chn : R/W; bitpos: [6:4]; default: 0;
         *  3'b000-3'b100:burst length 8byte~128byte
         */
        uint32_t in_burst_size_sel_chn:3;
        /** in_cmd_disable_chn : R/W; bitpos: [7]; default: 0;
         *  1:mean disable cmd of this ch0
         */
        uint32_t in_cmd_disable_chn:1;
        /** in_ecc_aec_en_chn : R/W; bitpos: [8]; default: 0;
         *  1: mean access ecc or aes domain,0: mean not
         */
        uint32_t in_ecc_aec_en_chn:1;
        /** indscr_burst_en_chn : R/W; bitpos: [9]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Rx channel 0 reading link
         *  descriptor when accessing internal SRAM.
         */
        uint32_t indscr_burst_en_chn:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} axi_dma_in_conf0_chn_reg_t;

/** Type of in_conf1_chn register
 *  Configure 1 register of Rx channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** in_check_owner_chn : R/W; bitpos: [12]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t in_check_owner_chn:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} axi_dma_in_conf1_chn_reg_t;

/** Type of infifo_status_chn register
 *  Receive FIFO status of Rx channel 0
 */
typedef union {
    struct {
        /** infifo_l3_full_chn : RO; bitpos: [0]; default: 1;
         *  L3 Rx FIFO full signal for Rx channel 0.
         */
        uint32_t infifo_l3_full_chn:1;
        /** infifo_l3_empty_chn : RO; bitpos: [1]; default: 1;
         *  L3 Rx FIFO empty signal for Rx channel 0.
         */
        uint32_t infifo_l3_empty_chn:1;
        /** infifo_l3_cnt_chn : RO; bitpos: [7:2]; default: 0;
         *  The register stores the byte number of the data in L3 Rx FIFO for Rx channel 0.
         */
        uint32_t infifo_l3_cnt_chn:6;
        /** infifo_l3_udf_chn : RO; bitpos: [8]; default: 0;
         *  L3 Rx FIFO under flow signal for Rx channel 0.
         */
        uint32_t infifo_l3_udf_chn:1;
        /** infifo_l3_ovf_chn : RO; bitpos: [9]; default: 0;
         *  L3 Rx FIFO over flow signal for Rx channel 0.
         */
        uint32_t infifo_l3_ovf_chn:1;
        /** infifo_l1_full_chn : RO; bitpos: [10]; default: 0;
         *  L1 Rx FIFO full signal for Rx channel 0.
         */
        uint32_t infifo_l1_full_chn:1;
        /** infifo_l1_empty_chn : RO; bitpos: [11]; default: 1;
         *  L1 Rx FIFO empty signal for Rx channel 0.
         */
        uint32_t infifo_l1_empty_chn:1;
        /** infifo_l1_udf_chn : RO; bitpos: [12]; default: 0;
         *  L1 Rx FIFO under flow signal for Rx channel 0.
         */
        uint32_t infifo_l1_udf_chn:1;
        /** infifo_l1_ovf_chn : RO; bitpos: [13]; default: 0;
         *  L1 Rx FIFO over flow signal for Rx channel 0.
         */
        uint32_t infifo_l1_ovf_chn:1;
        /** infifo_l2_full_chn : RO; bitpos: [14]; default: 0;
         *  L2 Rx RAM full signal for Rx channel 0.
         */
        uint32_t infifo_l2_full_chn:1;
        /** infifo_l2_empty_chn : RO; bitpos: [15]; default: 1;
         *  L2 Rx RAM empty signal for Rx channel 0.
         */
        uint32_t infifo_l2_empty_chn:1;
        /** infifo_l2_udf_chn : RO; bitpos: [16]; default: 0;
         *  L2 Rx FIFO under flow signal for Rx channel 0.
         */
        uint32_t infifo_l2_udf_chn:1;
        /** infifo_l2_ovf_chn : RO; bitpos: [17]; default: 0;
         *  L2 Rx FIFO over flow signal for Rx channel 0.
         */
        uint32_t infifo_l2_ovf_chn:1;
        uint32_t reserved_18:5;
        /** in_remain_under_1b_chn : RO; bitpos: [23]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_1b_chn:1;
        /** in_remain_under_2b_chn : RO; bitpos: [24]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_2b_chn:1;
        /** in_remain_under_3b_chn : RO; bitpos: [25]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_3b_chn:1;
        /** in_remain_under_4b_chn : RO; bitpos: [26]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_4b_chn:1;
        /** in_remain_under_5b_chn : RO; bitpos: [27]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_5b_chn:1;
        /** in_remain_under_6b_chn : RO; bitpos: [28]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_6b_chn:1;
        /** in_remain_under_7b_chn : RO; bitpos: [29]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_7b_chn:1;
        /** in_remain_under_8b_chn : RO; bitpos: [30]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_8b_chn:1;
        /** in_buf_hungry_chn : RO; bitpos: [31]; default: 0;
         *  reserved
         */
        uint32_t in_buf_hungry_chn:1;
    };
    uint32_t val;
} axi_dma_infifo_status_chn_reg_t;

