espressif/esp-idf/components/soc/esp32p4/include/soc/axi_dma_struct.h
/** Type of out_link2_chn register
 *  Link descriptor configure and control register of Tx channel0
 */
typedef union {
    struct {
        /** outlink_addr_chn : R/W; bitpos: [31:0]; default: 0;
         *  This register stores the 32 least significant bits of the first outlink
         *  descriptor's address.
         */
        uint32_t outlink_addr_chn:32;
    };
    uint32_t val;
} axi_dma_out_link2_chn_reg_t;

/** Type of out_state_chn register
 *  Transmit status of Tx channel0
 */
typedef union {
    struct {
        /** outlink_dscr_addr_chn : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current outlink descriptor's address.
         */
        uint32_t outlink_dscr_addr_chn:18;
        /** out_dscr_state_chn : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t out_dscr_state_chn:2;
        /** out_state_chn : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t out_state_chn:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} axi_dma_out_state_chn_reg_t;

/** Type of out_eof_des_addr_chn register
 *  Outlink descriptor address when EOF occurs of Tx channel0
 */
typedef union {
    struct {
        /** out_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr_chn:32;
    };
    uint32_t val;
} axi_dma_out_eof_des_addr_chn_reg_t;

/** Type of out_eof_bfr_des_addr_chn register
 *  The last outlink descriptor address when EOF occurs of Tx channel0
 */
typedef union {
    struct {
        /** out_eof_bfr_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor before the last outlink
         *  descriptor.
         */
        uint32_t out_eof_bfr_des_addr_chn:32;
    };
    uint32_t val;
} axi_dma_out_eof_bfr_des_addr_chn_reg_t;

/** Type of out_dscr_chn register
 *  Current outlink descriptor address of Tx channel0
 */
typedef union {
    struct {
        /** outlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the current outlink descriptor y.
         */
        uint32_t outlink_dscr_chn:32;
    };
    uint32_t val;
} axi_dma_out_dscr_chn_reg_t;

/** Type of out_dscr_bf0_chn register
 *  The last outlink descriptor address of Tx channel0
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the last outlink descriptor y-1.
         */
        uint32_t outlink_dscr_bf0_chn:32;
    };
    uint32_t val;
} axi_dma_out_dscr_bf0_chn_reg_t;

/** Type of out_dscr_bf1_chn register
 *  The second-to-last outlink descriptor address of Tx channel0
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last outlink descriptor x-2.
         */
        uint32_t outlink_dscr_bf1_chn:32;
    };
    uint32_t val;
} axi_dma_out_dscr_bf1_chn_reg_t;

/** Type of out_pri_chn register
 *  Priority register of Tx channel0.
 */
typedef union {
    struct {
        /** tx_pri_chn : R/W; bitpos: [3:0]; default: 0;
         *  The priority of Tx channel0. The larger of the value the higher of the priority.
         */
        uint32_t tx_pri_chn:4;
        /** tx_ch_arb_weigh_chn : R/W; bitpos: [7:4]; default: 0;
         *  The weight of Tx channel0
         */
        uint32_t tx_ch_arb_weigh_chn:4;
        /** tx_arb_weigh_opt_dir_chn : R/W; bitpos: [8]; default: 0;
         *  0: mean not optimazation weight function ,1: mean optimazation
         */
        uint32_t tx_arb_weigh_opt_dir_chn:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} axi_dma_out_pri_chn_reg_t;

/** Type of out_peri_sel_chn register
 *  Peripheral selection of Tx channel0
 */
typedef union {
    struct {
        /** peri_out_sel_chn : R/W; bitpos: [5:0]; default: 63;
         *  This register is used to select peripheral for Tx channel0. 0:lcdcam. 1: gpspi_2.
         *  2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy
         */
        uint32_t peri_out_sel_chn:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} axi_dma_out_peri_sel_chn_reg_t;

/** Type of out_crc_init_data_chn register
 *  This register is used to config ch0 crc initial data(max 32 bit)
 */
typedef union {
    struct {
        /** out_crc_init_data_chn : R/W; bitpos: [31:0]; default: 4294967295;
         *  This register is used to config ch0 of tx crc initial value
         */
        uint32_t out_crc_init_data_chn:32;
    };
    uint32_t val;
} axi_dma_out_crc_init_data_chn_reg_t;

/** Type of tx_crc_width_chn register
 *  This register is used to confiig tx ch0 crc result width,2'b00 mean crc_width
 *  <=8bit,2'b01 8<crc_width<=16 ,2'b10 mean 16<crc_width  <=24,2'b11 mean
 *  24<crc_width<=32
 */
typedef union {
    struct {
        /** tx_crc_width_chn : R/W; bitpos: [1:0]; default: 0;
         *  reserved
         */
        uint32_t tx_crc_width_chn:2;
        /** tx_crc_lautch_flga_chn : R/W; bitpos: [2]; default: 0;
         *  reserved
         */
        uint32_t tx_crc_lautch_flga_chn:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} axi_dma_tx_crc_width_chn_reg_t;

/** Type of out_crc_clear_chn register
 *  This register is used to clear ch0 crc result
 */
typedef union {
    struct {
        /** out_crc_clear_chn_reg : R/W; bitpos: [0]; default: 0;
         *  This register is used to clear ch0 of tx crc result
         */
        uint32_t out_crc_clear_chn_reg:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} axi_dma_out_crc_clear_chn_reg_t;

/** Type of out_crc_final_result_chn register
 *  This register is used to store ch0 crc result
 */
typedef union {
    struct {
        /** out_crc_final_result_chn : RO; bitpos: [31:0]; default: 0;
         *  This register is used to store result ch0 of tx
         */
        uint32_t out_crc_final_result_chn:32;
    };
    uint32_t val;
} axi_dma_out_crc_final_result_chn_reg_t;

/** Type of tx_crc_en_wr_data_chn register
 *  This resister is used to config ch0 crc en for every bit
 */
typedef union {
    struct {
        /** tx_crc_en_wr_data_chn : R/W; bitpos: [31:0]; default: 0;
         *  This register is used to enable tx ch0 crc 32bit on/off
         */
        uint32_t tx_crc_en_wr_data_chn:32;
    };
    uint32_t val;
} axi_dma_tx_crc_en_wr_data_chn_reg_t;

/** Type of tx_crc_en_addr_chn register
 *  This register is used to config ch0 crc en addr
 */
typedef union {
    struct {
        /** tx_crc_en_addr_chn : R/W; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t tx_crc_en_addr_chn:32;
    };
    uint32_t val;
} axi_dma_tx_crc_en_addr_chn_reg_t;

/** Type of tx_crc_data_en_wr_data_chn register
 *  This register is used to config crc data_8bit en
 */
typedef union {
    struct {
        /** tx_crc_data_en_wr_data_chn : R/W; bitpos: [15:0]; default: 0;
         *  reserved
         */
        uint32_t tx_crc_data_en_wr_data_chn:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} axi_dma_tx_crc_data_en_wr_data_chn_reg_t;

