espressif/esp-idf/components/soc/esp32p4/include/soc/axi_dma_struct.h
/** Type of intr_mem_start_addr register
 *  The start address of accessible address space.
 */
typedef union {
    struct {
        /** access_intr_mem_start_addr : R/W; bitpos: [31:0]; default: 806354944;
         *  The start address of accessible address space.
         */
        uint32_t access_intr_mem_start_addr:32;
    };
    uint32_t val;
} axi_dma_intr_mem_start_addr_reg_t;

/** Type of intr_mem_end_addr register
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
typedef union {
    struct {
        /** access_intr_mem_end_addr : R/W; bitpos: [31:0]; default: 2415919103;
         *  The end address of accessible address space. The access address beyond this range
         *  would lead to descriptor error.
         */
        uint32_t access_intr_mem_end_addr:32;
    };
    uint32_t val;
} axi_dma_intr_mem_end_addr_reg_t;

/** Type of extr_mem_start_addr register
 *  The start address of accessible address space.
 */
typedef union {
    struct {
        /** access_extr_mem_start_addr : R/W; bitpos: [31:0]; default: 806354944;
         *  The start address of accessible address space.
         */
        uint32_t access_extr_mem_start_addr:32;
    };
    uint32_t val;
} axi_dma_extr_mem_start_addr_reg_t;

/** Type of extr_mem_end_addr register
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
typedef union {
    struct {
        /** access_extr_mem_end_addr : R/W; bitpos: [31:0]; default: 2415919103;
         *  The end address of accessible address space. The access address beyond this range
         *  would lead to descriptor error.
         */
        uint32_t access_extr_mem_end_addr:32;
    };
    uint32_t val;
} axi_dma_extr_mem_end_addr_reg_t;

/** Type of in_reset_avail_chn register
 *  The rx channel 0 reset valid_flag register.
 */
typedef union {
    struct {
        /** in_reset_avail_chn : RO; bitpos: [0]; default: 1;
         *  rx chan0 reset valid reg.
         */
        uint32_t in_reset_avail_chn:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} axi_dma_in_reset_avail_chn_reg_t;

/** Type of out_reset_avail_chn register
 *  The tx channel 0 reset valid_flag register.
 */
typedef union {
    struct {
        /** out_reset_avail_chn : RO; bitpos: [0]; default: 1;
         *  tx chan0 reset valid reg.
         */
        uint32_t out_reset_avail_chn:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} axi_dma_out_reset_avail_chn_reg_t;

/** Type of misc_conf register
 *  MISC register
 */
typedef union {
    struct {
        /** axim_rst_wr_inter : R/W; bitpos: [0]; default: 0;
         *  Set this bit then clear this bit to reset the internal axi_wr FSM.
         */
        uint32_t axim_rst_wr_inter:1;
        /** axim_rst_rd_inter : R/W; bitpos: [1]; default: 0;
         *  Set this bit then clear this bit to reset the internal axi_rd FSM.
         */
        uint32_t axim_rst_rd_inter:1;
        uint32_t reserved_2:1;
        /** arb_pri_dis : R/W; bitpos: [3]; default: 0;
         *  Set this bit to disable priority arbitration function.
         */
        uint32_t arb_pri_dis:1;
        /** clk_en : R/W; bitpos: [4]; default: 0;
         *  1'h1: Force clock on for register. 1'h0: Support clock only when application writes
         *  registers.
         */
        uint32_t clk_en:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} axi_dma_misc_conf_reg_t;


/** Group: Debug Registers */
/** Type of rdn_result register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_ena : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t rdn_ena:1;
        /** rdn_result : RO; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t rdn_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} axi_dma_rdn_result_reg_t;

/** Type of rdn_eco_high register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  The start address of accessible address space.
         */
        uint32_t rdn_eco_high:32;
    };
    uint32_t val;
} axi_dma_rdn_eco_high_reg_t;

/** Type of rdn_eco_low register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  The start address of accessible address space.
         */
        uint32_t rdn_eco_low:32;
    };
    uint32_t val;
} axi_dma_rdn_eco_low_reg_t;


/** Group: Status Registers */
/** Type of wresp_cnt register
 *  AXI wr responce cnt register.
 */
typedef union {
    struct {
        /** wresp_cnt : RO; bitpos: [3:0]; default: 0;
         *  axi wr responce cnt reg.
         */
        uint32_t wresp_cnt:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} axi_dma_wresp_cnt_reg_t;

/** Type of rresp_cnt register
 *  AXI wr responce cnt register.
 */
typedef union {
    struct {
        /** rresp_cnt : RO; bitpos: [3:0]; default: 0;
         *  axi rd responce cnt reg.
         */
        uint32_t rresp_cnt:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} axi_dma_rresp_cnt_reg_t;

/** Type of infifo_status1_chn register
 *  Receive FIFO status of Rx channel 0
 */
typedef union {
    struct {
        /** l1infifo_cnt_chn : RO; bitpos: [5:0]; default: 0;
         *  The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.
         */
        uint32_t l1infifo_cnt_chn:6;
        /** l2infifo_cnt_chn : RO; bitpos: [9:6]; default: 0;
         *  The register stores the byte number of the data in L2 Rx FIFO for Rx channel 0.
         */
        uint32_t l2infifo_cnt_chn:4;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} axi_dma_infifo_status1_chn_reg_t;

/** Type of outfifo_status1_chn register
 *  Receive FIFO status of Tx channel 0
 */
typedef union {
    struct {
        /** l1outfifo_cnt_chn : RO; bitpos: [5:0]; default: 0;
         *  The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0.
         */
        uint32_t l1outfifo_cnt_chn:6;
        /** l2outfifo_cnt_chn : RO; bitpos: [9:6]; default: 0;
         *  The register stores the byte number of the data in L2 Tx FIFO for Tx channel 0.
         */
        uint32_t l2outfifo_cnt_chn:4;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} axi_dma_outfifo_status1_chn_reg_t;


