espressif/esp-idf/components/soc/esp32p4/include/soc/axi_dma_struct.h
/** Group: Version Registers */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 36712768;
         *  register version.
         */
        uint32_t date:32;
    };
    uint32_t val;
} axi_dma_date_reg_t;

typedef struct {
    volatile axi_dma_in_int_raw_chn_reg_t in_int_raw;
    volatile axi_dma_in_int_st_chn_reg_t in_int_st;
    volatile axi_dma_in_int_ena_chn_reg_t in_int_ena;
    volatile axi_dma_in_int_clr_chn_reg_t in_int_clr;
} axi_dma_in_int_chn_reg_t;

typedef struct {
    volatile axi_dma_in_conf0_chn_reg_t in_conf0;
    volatile axi_dma_in_conf1_chn_reg_t in_conf1;
    volatile axi_dma_infifo_status_chn_reg_t infifo_status;
    volatile axi_dma_in_pop_chn_reg_t in_pop;
    volatile axi_dma_in_link1_chn_reg_t in_link1;
    volatile axi_dma_in_link2_chn_reg_t in_link2;
    volatile axi_dma_in_state_chn_reg_t in_state;
    volatile axi_dma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr;
    volatile axi_dma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr;
    volatile axi_dma_in_dscr_chn_reg_t in_dscr;
    volatile axi_dma_in_dscr_bf0_chn_reg_t in_dscr_bf0;
    volatile axi_dma_in_dscr_bf1_chn_reg_t in_dscr_bf1;
    volatile axi_dma_in_pri_chn_reg_t in_pri;
    volatile axi_dma_in_peri_sel_chn_reg_t in_peri_sel;
} axi_dma_in_conf_chn_reg_t;

typedef struct {
    volatile axi_dma_in_crc_init_data_chn_reg_t in_crc_init_data;
    volatile axi_dma_rx_crc_width_chn_reg_t rx_crc_width;
    volatile axi_dma_in_crc_clear_chn_reg_t in_crc_clear;
    volatile axi_dma_in_crc_final_result_chn_reg_t in_crc_final_result;
    volatile axi_dma_rx_crc_en_wr_data_chn_reg_t rx_crc_en_wr_data;
    volatile axi_dma_rx_crc_en_addr_chn_reg_t rx_crc_en_addr;
    volatile axi_dma_rx_crc_data_en_wr_data_chn_reg_t rx_crc_data_en_wr_data;
    volatile axi_dma_rx_crc_data_en_addr_chn_reg_t rx_crc_data_en_addr;
} axi_dma_in_crc_chn_reg_t;

typedef struct {
    volatile axi_dma_in_int_chn_reg_t in_intr;
    volatile axi_dma_in_conf_chn_reg_t in_conf;
    volatile axi_dma_in_crc_chn_reg_t in_crc;
} axi_dma_in_reg_t;

typedef struct {
    volatile axi_dma_out_int_raw_chn_reg_t out_int_raw;
    volatile axi_dma_out_int_st_chn_reg_t out_int_st;
    volatile axi_dma_out_int_ena_chn_reg_t out_int_ena;
    volatile axi_dma_out_int_clr_chn_reg_t out_int_clr;
} axi_dma_out_int_chn_reg_t;

typedef struct {
    volatile axi_dma_out_conf0_ch0_reg_t out_conf0;
    volatile axi_dma_out_conf1_chn_reg_t out_conf1;
    volatile axi_dma_outfifo_status_chn_reg_t outfifo_status;
    volatile axi_dma_out_push_chn_reg_t out_push;
    volatile axi_dma_out_link1_chn_reg_t out_link1;
    volatile axi_dma_out_link2_chn_reg_t out_link2;
    volatile axi_dma_out_state_chn_reg_t out_state;
    volatile axi_dma_out_eof_des_addr_chn_reg_t out_eof_des_addr;
    volatile axi_dma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr;
    volatile axi_dma_out_dscr_chn_reg_t out_dscr;
    volatile axi_dma_out_dscr_bf0_chn_reg_t out_dscr_bf0;
    volatile axi_dma_out_dscr_bf1_chn_reg_t out_dscr_bf1;
    volatile axi_dma_out_pri_chn_reg_t out_pri;
    volatile axi_dma_out_peri_sel_chn_reg_t out_peri_sel;
} axi_dma_out_conf_chn_reg_t;

typedef struct {
    volatile axi_dma_out_crc_init_data_chn_reg_t out_crc_init_data;
    volatile axi_dma_tx_crc_width_chn_reg_t tx_crc_width;
    volatile axi_dma_out_crc_clear_chn_reg_t out_crc_clear;
    volatile axi_dma_out_crc_final_result_chn_reg_t out_crc_final_result;
    volatile axi_dma_tx_crc_en_wr_data_chn_reg_t tx_crc_en_wr_data;
    volatile axi_dma_tx_crc_en_addr_chn_reg_t tx_crc_en_addr;
    volatile axi_dma_tx_crc_data_en_wr_data_chn_reg_t tx_crc_data_en_wr_data;
    volatile axi_dma_tx_crc_data_en_addr_chn_reg_t tx_crc_data_en_addr;
} axi_dma_out_crc_chn_reg_t;

typedef struct {
    volatile axi_dma_out_int_chn_reg_t in_intr;
    volatile axi_dma_out_conf_chn_reg_t in_conf;
    volatile axi_dma_out_crc_chn_reg_t in_crc;
} axi_dma_out_reg_t;

typedef struct {
    volatile axi_dma_in_reg_t in[3];
    volatile axi_dma_out_reg_t out[3];
    volatile axi_dma_arb_timeout_reg_t arb_timeout;
    volatile axi_dma_weight_en_reg_t weight_en;
    volatile axi_dma_in_mem_conf_reg_t in_mem_conf;
    volatile axi_dma_intr_mem_start_addr_reg_t intr_mem_start_addr;
    volatile axi_dma_intr_mem_end_addr_reg_t intr_mem_end_addr;
    volatile axi_dma_extr_mem_start_addr_reg_t extr_mem_start_addr;
    volatile axi_dma_extr_mem_end_addr_reg_t extr_mem_end_addr;
    volatile axi_dma_in_reset_avail_chn_reg_t in_reset_avail_chn[3];
    volatile axi_dma_out_reset_avail_chn_reg_t out_reset_avail_chn[3];
    uint32_t reserved_2a4;
    volatile axi_dma_misc_conf_reg_t misc_conf;
    volatile axi_dma_rdn_result_reg_t rdn_result;
    volatile axi_dma_rdn_eco_high_reg_t rdn_eco_high;
    volatile axi_dma_rdn_eco_low_reg_t rdn_eco_low;
    volatile axi_dma_wresp_cnt_reg_t wresp_cnt;
    volatile axi_dma_rresp_cnt_reg_t rresp_cnt;
    volatile axi_dma_infifo_status1_chn_reg_t infifo_status1_chn[3];
    volatile axi_dma_outfifo_status1_chn_reg_t outfifo_status1_chn[3];
    volatile axi_dma_date_reg_t date;
} axi_dma_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(axi_dma_dev_t) == 0x2dc, "Invalid size of axi_dma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
